espruino/Espruino/targets/nrf5x/jshardware.c
    if (pinDrive==GPIO_PIN_CNF_DRIVE_S0D1 || pinDrive==GPIO_PIN_CNF_DRIVE_H0D1) {
      if (pinPull==GPIO_PIN_CNF_PULL_Pullup)
        return JSHPINSTATE_GPIO_OUT_OPENDRAIN_PULLUP|hi;
      else {
        if (pinStates[pin])
          return JSHPINSTATE_AF_OUT_OPENDRAIN|hi;
        else
          return JSHPINSTATE_GPIO_OUT_OPENDRAIN|hi;
      }
    } else {
      if (pinStates[pin])
        return JSHPINSTATE_AF_OUT|hi;
      else
        return JSHPINSTATE_GPIO_OUT|hi;
    }
  } else {
    bool pinConnected = ((p&GPIO_PIN_CNF_INPUT_Msk)>>GPIO_PIN_CNF_INPUT_Pos) == GPIO_PIN_CNF_INPUT_Connect;
    // Input
    if ((p&GPIO_PIN_CNF_PULL_Msk)==(GPIO_PIN_CNF_PULL_Pullup<<GPIO_PIN_CNF_PULL_Pos)) {
      return negated ? JSHPINSTATE_GPIO_IN_PULLDOWN : JSHPINSTATE_GPIO_IN_PULLUP;
    } else if ((p&GPIO_PIN_CNF_PULL_Msk)==(GPIO_PIN_CNF_PULL_Pulldown<<GPIO_PIN_CNF_PULL_Pos)) {
      return negated ? JSHPINSTATE_GPIO_IN_PULLUP : JSHPINSTATE_GPIO_IN_PULLDOWN;
    } else {
      return pinConnected ? JSHPINSTATE_GPIO_IN : JSHPINSTATE_ADC_IN;
    }
  }
}

#ifdef NRF52_SERIES
nrf_saadc_value_t nrf_analog_read() {

  nrf_saadc_value_t result;
  nrf_saadc_buffer_init(&result,1);

  nrf_saadc_task_trigger(NRF_SAADC_TASK_START);

  WAIT_UNTIL(nrf_analog_read_interrupted||nrf_saadc_event_check(NRF_SAADC_EVENT_STARTED),"ADC_START");
  nrf_saadc_event_clear(NRF_SAADC_EVENT_STARTED);
  if (nrf_analog_read_interrupted) return -16384;

  nrf_saadc_task_trigger(NRF_SAADC_TASK_SAMPLE);


  WAIT_UNTIL(nrf_analog_read_interrupted||nrf_saadc_event_check(NRF_SAADC_EVENT_END),"ADC_END");
  nrf_saadc_event_clear(NRF_SAADC_EVENT_END);
  if (nrf_analog_read_interrupted) return -16384;

  nrf_saadc_task_trigger(NRF_SAADC_TASK_STOP);
  WAIT_UNTIL(nrf_analog_read_interrupted||nrf_saadc_event_check(NRF_SAADC_EVENT_STOPPED),"ADC_STOP");
  nrf_saadc_event_clear(NRF_SAADC_EVENT_STOPPED);
  if (nrf_analog_read_interrupted) return -16384;

  return result;
}

bool nrf_analog_read_start() {
  // Were we already doing a read? We might have jumped in via IRQ and
  // interrupted an existing reading...
  if (nrf_saadc_enable_check()) {
    // if so, cancel old reading
    nrf_saadc_task_trigger(NRF_SAADC_TASK_STOP);
    WAIT_UNTIL(nrf_saadc_event_check(NRF_SAADC_EVENT_STOPPED),"ADC_STOP2");
    nrf_saadc_event_clear(NRF_SAADC_EVENT_STOPPED);
    nrf_saadc_event_clear(NRF_SAADC_EVENT_STARTED);
    nrf_saadc_event_clear(NRF_SAADC_EVENT_END);
    nrf_saadc_disable();
    nrf_saadc_channel_input_set(0, NRF_SAADC_INPUT_DISABLED, NRF_SAADC_INPUT_DISABLED); // give us back our pin!
    return true;
  }
  return false;
}

void nrf_analog_read_end(bool adcInUse) {
  if (adcInUse)
    nrf_analog_read_interrupted = true;
  nrf_saadc_disable();
  nrf_saadc_channel_input_set(0, NRF_SAADC_INPUT_DISABLED, NRF_SAADC_INPUT_DISABLED); // give us back our pin!
}
#endif

#ifdef NRF52_SERIES
static void jshPinAnalogSetConfig(nrf_saadc_channel_config_t *config, Pin pin) {
  nrf_saadc_input_t ain = 1 + (pinInfo[pin].analog & JSH_MASK_ANALOG_CH);
  config->acq_time = NRF_SAADC_ACQTIME_3US;
  config->gain = NRF_SAADC_GAIN1_4; // 1/4 of input volts
  config->reference = NRF_SAADC_REFERENCE_VDD4; // VDD/4 as reference.
#ifdef MICROBIT2
  if (pin == MIC_PIN) {
    config->gain = NRF_SAADC_GAIN4; // the mic needs highest gain
    config->reference = NRF_SAADC_REFERENCE_INTERNAL; // 0.6v reference.
  }
#endif
  config->mode = NRF_SAADC_MODE_SINGLE_ENDED;
  config->pin_p = ain;
  config->pin_n = ain;

  config->resistor_p = NRF_SAADC_RESISTOR_DISABLED;
  config->resistor_n = NRF_SAADC_RESISTOR_DISABLED;
}
#endif

// Returns an analog value between 0 and 1
JsVarFloat jshPinAnalog(Pin pin) {
#if JSH_PORTV_COUNT>0
  // handle virtual ports (eg. pins on an IO Expander)
  if ((pinInfo[pin].port & JSH_PORT_MASK)==JSH_PORTV)
    return jshVirtualPinGetAnalogValue(pin);
#endif
  if (pinInfo[pin].analog == JSH_ANALOG_NONE) return NAN;

#ifdef JOLTJS
  // Bit of a hack for Jolt.js - don't change pin state as it's not actually the pin we're measuring! The defaults for analogs
  // are JSHPINSTATE_ADC_IN anyway so we should be ok
  if ((pinInfo[pin].port & JSH_PORT_MASK)!=JSH_PORTH)
#endif
  if (!jshGetPinStateIsManual(pin))
    jshPinSetState(pin, JSHPINSTATE_ADC_IN);
#ifdef NRF52_SERIES
  int channel = pinInfo[pin].analog & JSH_MASK_ANALOG_CH;
  assert(NRF_SAADC_INPUT_AIN0 == 1);
  assert(NRF_SAADC_INPUT_AIN1 == 2);
  assert(NRF_SAADC_INPUT_AIN2 == 3);

  nrf_saadc_channel_config_t config;
  jshPinAnalogSetConfig(&config, pin);

  bool adcInUse = nrf_analog_read_start();

  // make reading
  JsVarFloat f;
  do {
    nrf_analog_read_interrupted = false;
    nrf_saadc_enable();
    nrf_saadc_resolution_set(NRF_SAADC_RESOLUTION_14BIT);
    nrf_saadc_channel_init(0, &config);

    f = nrf_analog_read() / 16384.0;
  } while (nrf_analog_read_interrupted);

  nrf_analog_read_end(adcInUse);
#else
  const nrf_adc_config_t nrf_adc_config =  {
      NRF_ADC_CONFIG_RES_10BIT,
      NRF_ADC_CONFIG_SCALING_INPUT_FULL_SCALE,
      NRF_ADC_CONFIG_REF_VBG }; // internal reference
  nrf_adc_configure( (nrf_adc_config_t *)&nrf_adc_config);
  // sanity checks for nrf_adc_convert_single...
  assert(ADC_CONFIG_PSEL_AnalogInput0 == 1);
  assert(ADC_CONFIG_PSEL_AnalogInput1 == 2);
  assert(ADC_CONFIG_PSEL_AnalogInput2 == 4);
  // make reading
  JsVarFloat f = nrf_adc_convert_single(1 << (pinInfo[pin].analog & JSH_MASK_ANALOG_CH)) / 1024.0;
#endif
#ifdef JOLTJS
  // Bit of a hack for Jolt.js where we have a 39k + 220k potential divider
  // Multiply up so we return the actual voltage -> 3.3*(220+39)/39 = 21.915
  if ((pinInfo[pin].port & JSH_PORT_MASK)==JSH_PORTH)
    return f * 21.915;
#endif
  return f;
}

/// Returns a quickly-read analog value in the range 0-65535
int jshPinAnalogFast(Pin pin) {
  if (pinInfo[pin].analog == JSH_ANALOG_NONE) return 0;

#ifdef NRF52_SERIES
  // sanity checks for channel
  assert(NRF_SAADC_INPUT_AIN0 == 1);
  assert(NRF_SAADC_INPUT_AIN1 == 2);
  assert(NRF_SAADC_INPUT_AIN2 == 3);

