espruino/Espruino/targets/nrf5x/jshardware.c
/// Enable watchdog with a timeout in seconds
void jshEnableWatchDog(JsVarFloat timeout) {
  NRF_WDT->CONFIG = (WDT_CONFIG_HALT_Pause << WDT_CONFIG_HALT_Pos) | ( WDT_CONFIG_SLEEP_Run << WDT_CONFIG_SLEEP_Pos);
  NRF_WDT->CRV = (int)(timeout*32768);
  NRF_WDT->RREN |= WDT_RREN_RR0_Msk;  //Enable reload register 0
  NRF_WDT->TASKS_START = 1;
}

void jshKickWatchDog() {
  NRF_WDT->RR[0] = 0x6E524635;
}

/** Check the pin associated with this EXTI - return true if it is a 1 */
bool jshGetWatchedPinState(IOEventFlags device) {
  return lastHandledPinState;
}

bool jshIsEventForPin(IOEvent *event, Pin pin) {
  return IOEVENTFLAGS_GETTYPE(event->flags) == jshGetEventFlagsForWatchedPin((uint32_t)pinInfo[pin].pin);
}

/** Is the given device initialised? */
bool jshIsDeviceInitialised(IOEventFlags device) {
#if SPI_ENABLED
  if (device==EV_SPI1) return spi0Initialised;
#endif
#if TWI_ENABLED
  if (device==EV_I2C1) return twi1Initialised;
#endif
#if ESPR_USART_COUNT>0
  if (DEVICE_IS_USART(device)) return uart[device-EV_SERIAL1].isInitialised;
#endif
  return false;
}
#if ESPR_USART_COUNT>0

void uart_startrx(int num) {
  uint32_t err_code;
  err_code = nrf_drv_uart_rx(&UART[num], &uart[num].rxBuffer[0],1);
#ifndef SAVE_ON_FLASH
  if (err_code) jsWarn("nrf_drv_uart_rx 1 failed, error %d", err_code);
#endif
  err_code = nrf_drv_uart_rx(&UART[num], &uart[num].rxBuffer[1],1);
#ifndef SAVE_ON_FLASH
  if (err_code) jsWarn("nrf_drv_uart_rx 2 failed, error %d", err_code);
#endif
}

void uart_starttx(int num) {
  int ch = jshGetCharToTransmit(EV_SERIAL1+num);
  if (ch >= 0) {
#ifdef ESPR_UART_7BIT
    if (uart[num].is7Bit) ch&=0x7F;
    if (uart[num].parity) { // set parity (which is now in bit 8)
      if (calculateParity(ch)==(uart[num].parity==2)) ch |= 0x80;
    }
#endif
    uart[num].isSending = true;
    uart[num].txBuffer[0] = ch;
    ret_code_t err_code = nrf_drv_uart_tx(&UART[num], uart[num].txBuffer, 1);
#ifndef SAVE_ON_FLASH
    if (err_code) jsWarn("nrf_drv_uart_tx failed, error %d", err_code);
#endif
  } else
    uart[num].isSending = false;
}

static void uart_event_handle(int num, nrf_drv_uart_event_t * p_event, void* p_context) {
    if (p_event->type == NRF_DRV_UART_EVT_RX_DONE) {
      // Char received
      uint8_t ch = p_event->data.rxtx.p_data[0];
      nrf_drv_uart_rx(&UART[num], p_event->data.rxtx.p_data, 1);
#ifdef ESPR_UART_7BIT
      if (uart[num].is7Bit) {
        bool parityBit = (ch&0x80) != 0;
        ch&=0x7F;
        if (uart[num].parity) { // check parity (which was in bit 8)
          if ((calculateParity(ch)==parityBit)!=(uart[num].parity==2)) {
            // parity error. Should we report it?
            if (jshGetErrorHandlingEnabled(EV_SERIAL1+num))
              jshPushIOEvent(IOEVENTFLAGS_SERIAL_TO_SERIAL_STATUS(EV_SERIAL1+num) | EV_SERIAL_STATUS_PARITY_ERR, 0);
          }
        }
      }
#endif
      jshPushIOCharEvent(EV_SERIAL1+num, (char)ch);
      jshHadEvent();
    } else if (p_event->type == NRF_DRV_UART_EVT_ERROR) {
      // error
      if (p_event->data.error.error_mask & (UART_ERRORSRC_BREAK_Msk|UART_ERRORSRC_FRAMING_Msk) && jshGetErrorHandlingEnabled(EV_SERIAL1+num))
        jshPushIOEvent(IOEVENTFLAGS_SERIAL_TO_SERIAL_STATUS(EV_SERIAL1+num) | EV_SERIAL_STATUS_FRAMING_ERR, 0);
      if (p_event->data.error.error_mask & (UART_ERRORSRC_PARITY_Msk) && jshGetErrorHandlingEnabled(EV_SERIAL1+num))
        jshPushIOEvent(IOEVENTFLAGS_SERIAL_TO_SERIAL_STATUS(EV_SERIAL1+num) | EV_SERIAL_STATUS_PARITY_ERR, 0);
      if (p_event->data.error.error_mask & (UART_ERRORSRC_OVERRUN_Msk))
        jsErrorFlags |= JSERR_UART_OVERFLOW;
      // restart RX on both buffers
      uart_startrx(num);
      jshHadEvent();
    } else if (p_event->type == NRF_DRV_UART_EVT_TX_DONE) {
      // ready to transmit another character...
      uart_starttx(num);
    }
}

static void uart0_event_handle(nrf_drv_uart_event_t * p_event, void* p_context) {
  uart_event_handle(0, p_event, p_context);
}
#if ESPR_USART_COUNT>1
static void uart1_event_handle(nrf_drv_uart_event_t * p_event, void* p_context) {
  uart_event_handle(1, p_event, p_context);
}
#endif

void jshUSARTUnSetup(IOEventFlags device) {
  if (!DEVICE_IS_USART(device))
    return;
  unsigned int num = device-EV_SERIAL1;
  if (!uart[num].isInitialised)
    return;
  uart[num].isInitialised = false;
  jshTransmitClearDevice(device);
  nrf_drv_uart_rx_disable(&UART[num]);
  nrf_drv_uart_tx_abort(&UART[num]);

  jshSetFlowControlEnabled(device, false, PIN_UNDEFINED);
  nrf_drv_uart_uninit(&UART[num]);
#ifdef NRF52840
  /* Fix for +900uA power draw. We *do* call nrf_drv_uart_rx_disable and
   also tried with nrf_drv_uart_rx_abort but it doesn't fix it. Easier just
   to do whatever this is (hardware reset?)
   https://devzone.nordicsemi.com/f/nordic-q-a/26030/how-to-reach-nrf52840-uarte-current-supply-specification/102605#102605
   */
  volatile uint32_t *internalReg = (volatile uint32_t *)((size_t)UART[num].uarte.p_reg + 0xFFC);
  *internalReg = 0;
  *internalReg;
  *internalReg = 1;
#endif
}


/** Set up a UART, if pins are -1 they will be guessed */
void jshUSARTSetup(IOEventFlags device, JshUSARTInfo *inf) {
  if (!DEVICE_IS_USART(device))
    return;

  unsigned int num = device-EV_SERIAL1;

  if (uart[num].isInitialised) {
    uart[num].isInitialised = false;
    nrf_drv_uart_uninit(&UART[num]);
  }

  nrf_uart_baudrate_t baud = (nrf_uart_baudrate_t)nrf_utils_get_baud_enum(inf->baudRate);
  if (baud==0)
    return jsError("Invalid baud rate %d", inf->baudRate);
  if (!jshIsPinValid(inf->pinRX) && !jshIsPinValid(inf->pinTX))
    return jsError("Invalid RX or TX pins");

  jshSetFlowControlEnabled(device, inf->xOnXOff, inf->pinCTS);
  jshSetErrorHandlingEnabled(device, inf->errorHandling);

  if (inf->stopbits!=1)
    return jsExceptionHere(JSET_INTERNALERROR, "Unsupported serial stopbits length");

  uart[num].isInitialised = false;
  if (inf->bytesize==8) {
    if (inf->parity==1)
      return jsExceptionHere(JSET_INTERNALERROR, "Odd parity not supported");
#ifdef ESPR_UART_7BIT
    uart[num].is7Bit = false;
    uart[num].parity = 0;
  } else if (inf->bytesize==7) {
    uart[num].is7Bit = true;
    uart[num].parity = inf->parity;
    inf->parity = 0; // no parity bit for 7 bit output
#endif
  } else
    return jsExceptionHere(JSET_INTERNALERROR, "Unsupported serial byte size");

  JshPinFunction JSH_USART = JSH_USART1+(num<<JSH_SHIFT_TYPE);

  // APP_UART_INIT will set pins, but this ensures we know so can reset state later
  if (jshIsPinValid(inf->pinRX)) jshPinSetFunction(inf->pinRX, JSH_USART|JSH_USART_RX);
  if (jshIsPinValid(inf->pinTX)) jshPinSetFunction(inf->pinTX, JSH_USART|JSH_USART_TX);

