espruino/Espruino/targets/nrf5x/jshardware.c
}

/** Set whether to send 16 bits or 8 over SPI */
void jshSPISet16(IOEventFlags device, bool is16) {
}

/** Set whether to use the receive interrupt or not */
void jshSPISetReceive(IOEventFlags device, bool isReceive) {
}

/** Wait until SPI send is finished, and flush all received data */
void jshSPIWait(IOEventFlags device) {
#if SPI_ENABLED
  WAIT_UNTIL(!spi0Sending, "SPI0");
#endif
}
#ifdef I2C_SLAVE
static void twis_event_handler(nrf_drv_twis_evt_t const * const p_event)
{
    switch (p_event->type)
    {
    case TWIS_EVT_READ_REQ:
        if (p_event->data.buf_req) {
          JsVar *i2c = jsvObjectGetChildIfExists(execInfo.root,"I2C1");
          if (i2c) {
            JsVar *buf = jsvObjectGetChildIfExists(i2c,"buffer");
            size_t bufLen;
            char *bufPtr = jsvGetDataPointer(buf, &bufLen);
            if (bufPtr && bufLen>twisAddr)
              nrf_drv_twis_tx_prepare(&TWIS1, bufPtr + twisAddr, bufLen - twisAddr);
            else
              nrf_drv_twis_tx_prepare(&TWIS1, twisRxBuf, 0);
            jsvUnLock2(i2c,buf);
          }
        }
        break;
    case TWIS_EVT_READ_DONE:
        jshPushIOEvent(EV_I2C1, twisAddr|0x80|(p_event->data.tx_amount<<8)); // send event to indicate a read
        jshHadEvent();
        twisAddr += p_event->data.tx_amount;
        break;
    case TWIS_EVT_WRITE_REQ:
        if (p_event->data.buf_req)
          nrf_drv_twis_rx_prepare(&TWIS1, twisRxBuf, sizeof(twisRxBuf));
        break;
    case TWIS_EVT_WRITE_DONE:
        if (p_event->data.rx_amount>0) {
          twisAddr = twisRxBuf[0];
          if (p_event->data.rx_amount>1) {
            jshPushIOEvent(EV_I2C1, twisAddr|((p_event->data.rx_amount-1)<<8)); // send event to indicate a write
            jshHadEvent();
            JsVar *i2c = jsvObjectGetChildIfExists(execInfo.root,"I2C1");
            if (i2c) {
              JsVar *buf = jsvObjectGetChildIfExists(i2c,"buffer");
              size_t bufLen;
              char *bufPtr = jsvGetDataPointer(buf, &bufLen);
              for (unsigned int i=1;i<p_event->data.rx_amount;i++) {
                if (bufPtr && twisAddr<bufLen)
                  bufPtr[twisAddr] = twisRxBuf[i];
                twisAddr++;
              }
              jsvUnLock2(i2c,buf);
            }
          }
        }
        break;

    case TWIS_EVT_READ_ERROR:
    case TWIS_EVT_WRITE_ERROR:
    case TWIS_EVT_GENERAL_ERROR:
        //m_error_flag = true;
        break;
    default:
        break;
    }
}
#endif

#if TWI_ENABLED || defined(I2C_SLAVE)
/** Set up I2C, if pins are -1 they will be guessed */
void jshI2CSetup(IOEventFlags device, JshI2CInfo *inf) {
  if (!jshIsPinValid(inf->pinSCL) || !jshIsPinValid(inf->pinSDA)) {
    jsError("SDA and SCL pins must be valid, got %d and %d\n", inf->pinSDA, inf->pinSCL);
    return;
  }
  uint32_t err_code;
#ifdef I2C_SLAVE
  if ((device == EV_I2C1) && nrf_drv_twis_is_enabled(TWIS1_INSTANCE_INDEX)) {
    nrf_drv_twis_disable(&TWIS1);
    nrf_drv_twis_uninit(&TWIS1);
  }
  if (inf->slaveAddr >=0) {
    const nrf_drv_twis_t *twis = jshGetTWIS(device);
    if (!twis) return;
    const nrf_drv_twis_config_t config =
    {
        .addr               = {inf->slaveAddr, 0},
        .scl                = (uint32_t)pinInfo[inf->pinSCL].pin,
        .scl_pull           = NRF_GPIO_PIN_PULLUP,
        .sda                = (uint32_t)pinInfo[inf->pinSDA].pin,
        .sda_pull           = NRF_GPIO_PIN_PULLUP,
        .interrupt_priority = APP_IRQ_PRIORITY_HIGH
    };
    err_code = nrf_drv_twis_init(twis, &config, twis_event_handler);
    if (err_code != NRF_SUCCESS)
      jsExceptionHere(JSET_INTERNALERROR, "I2C Initialisation Error %d", err_code);
    else
      nrf_drv_twis_enable(twis);
  } else
#endif
#if TWI_ENABLED
  {
    const nrf_drv_twi_t *twi = jshGetTWI(device);
    if (!twi) return;
    // http://infocenter.nordicsemi.com/index.jsp?topic=%2Fcom.nordic.infocenter.sdk51.v9.0.0%2Fhardware_driver_twi.html&cp=4_1_0_2_10
    nrf_drv_twi_config_t    p_twi_config;
    p_twi_config.scl = (uint32_t)pinInfo[inf->pinSCL].pin;
    p_twi_config.sda = (uint32_t)pinInfo[inf->pinSDA].pin;
    p_twi_config.frequency = (inf->bitrate<175000) ? NRF_TWI_FREQ_100K : ((inf->bitrate<325000) ? NRF_TWI_FREQ_250K : NRF_TWI_FREQ_400K);
    p_twi_config.interrupt_priority = APP_IRQ_PRIORITY_LOW;
    if (twi1Initialised) nrf_drv_twi_uninit(twi);
    twi1Initialised = true;
    err_code = nrf_drv_twi_init(twi, &p_twi_config, NULL, NULL);
    if (err_code != NRF_SUCCESS)
      jsExceptionHere(JSET_INTERNALERROR, "I2C Initialisation Error %d", err_code);
    else
      nrf_drv_twi_enable(twi);
  }
#endif
  // nrf_drv_spi_init will set pins, but this ensures we know so can reset state later
  if (jshIsPinValid(inf->pinSCL)) {
    jshPinSetFunction(inf->pinSCL, JSH_I2C1|JSH_I2C_SCL);
  }
  if (jshIsPinValid(inf->pinSDA)) {
    jshPinSetFunction(inf->pinSDA, JSH_I2C1|JSH_I2C_SDA);
  }
}
#endif

#if TWI_ENABLED
/** Addresses are 7 bit - that is, between 0 and 0x7F. sendStop is whether to send a stop bit or not */
void jshI2CWrite(IOEventFlags device, unsigned char address, int nBytes, const unsigned char *data, bool sendStop) {
  const  nrf_drv_twi_t *twi = jshGetTWI(device);
  if (!twi || !jshIsDeviceInitialised(device)) return;
  uint32_t err_code = nrf_drv_twi_tx(twi, address, data, nBytes, !sendStop);
  if (err_code != NRF_SUCCESS)
    jsExceptionHere(JSET_INTERNALERROR, "I2C Write Error %d", err_code);
}

void jshI2CRead(IOEventFlags device, unsigned char address, int nBytes, unsigned char *data, bool sendStop) {
  const nrf_drv_twi_t *twi = jshGetTWI(device);
  if (!twi || !jshIsDeviceInitialised(device)) return;
  uint32_t err_code = nrf_drv_twi_rx(twi, address, data, nBytes);
  if (err_code != NRF_SUCCESS)
    jsExceptionHere(JSET_INTERNALERROR, "I2C Read Error %d", err_code);
}
#endif // TWI_ENABLED


bool jshFlashWriteProtect(uint32_t addr) {
  // allow protection to be overwritten
  if (jsfGetFlag(JSF_UNSAFE_FLASH)) return false;
/* It's vital we don't let anyone screw with the softdevice or bootloader.
 * Recovering from changes would require soldering onto SWDIO and SWCLK pads!
 */
#if defined(PUCKJS) || defined(PIXLJS) || defined(MDBT42Q) || defined(BANGLEJS_F18)
  if (addr<0x1f000) return true; // softdevice
  if (addr>=0x78000 && addr<0x80000) return true; // bootloader
#endif
#if defined(BANGLEJS_Q3)
  if (addr<0x26000) return true; // softdevice
  if (addr>=0xF7000 && addr<0x100000) return true; // bootloader
#endif
  // TODO: make these use constants from the nRF52 SDK?
  return false;
}

/// Return start address and size of the flash page the given address resides in. Returns false if no page.
bool jshFlashGetPage(uint32_t addr, uint32_t * startAddr, uint32_t * pageSize) {
#ifdef SPIFLASH_BASE
  if ((addr >= SPIFLASH_BASE) && (addr < (SPIFLASH_BASE+SPIFLASH_LENGTH))) {
    *startAddr = (uint32_t)(addr & ~(SPIFLASH_PAGESIZE-1));
    *pageSize = SPIFLASH_PAGESIZE;
    return true;
  }
#endif
  if (addr > (NRF_FICR->CODEPAGESIZE * NRF_FICR->CODESIZE))
    return false;
  *startAddr = (uint32_t)(addr & ~(NRF_FICR->CODEPAGESIZE-1));
  *pageSize = NRF_FICR->CODEPAGESIZE;
  return true;
}

static void addFlashArea(JsVar *jsFreeFlash, uint32_t addr, uint32_t length) {
  JsVar *jsArea = jsvNewObject();
  if (!jsArea) return;
  jsvObjectSetChildAndUnLock(jsArea, "addr", jsvNewFromInteger((JsVarInt)addr));
  jsvObjectSetChildAndUnLock(jsArea, "length", jsvNewFromInteger((JsVarInt)length));
  jsvArrayPushAndUnLock(jsFreeFlash, jsArea);
}

JsVar *jshFlashGetFree() {
  JsVar *jsFreeFlash = jsvNewEmptyArray();
  if (!jsFreeFlash) return 0;
  /* Try and find pages after the end of firmware but before saved code */
  extern uint32_t LINKER_ETEXT_VAR; // end of flash text (binary) section
  uint32_t firmwareEnd = (uint32_t)&LINKER_ETEXT_VAR;
  extern uint32_t __isr_vector; // defined in gcc_startup_nrf5x.S, first address of binary
  uint32_t firmwareStart = (uint32_t)& __isr_vector;
  uint32_t pAddr, pSize;
  jshFlashGetPage(firmwareEnd, &pAddr, &pSize);
  firmwareEnd = pAddr+pSize;
#ifdef SPIFLASH_BASE
#if SPIFLASH_BASE <= FLASH_SAVED_CODE_START
  // we have storage in external flash (so we cannot take is as end of free internal flash)
  if (firmwareEnd < firmwareStart+FLASH_AVAILABLE_FOR_CODE)
    addFlashArea(jsFreeFlash, firmwareEnd, FLASH_AVAILABLE_FOR_CODE-(firmwareEnd-firmwareStart)); // size = available flash - size of binary
#if SPIFLASH_BASE < FLASH_SAVED_CODE_START
  // add SPI FLASH below code start
  addFlashArea(jsFreeFlash, SPIFLASH_BASE, FLASH_SAVED_CODE_START-SPIFLASH_BASE);
#endif
#if (FLASH_SAVED_CODE_START+FLASH_SAVED_CODE_LENGTH) < (SPIFLASH_BASE+SPIFLASH_LENGTH)
  // add SPI flash space between code end and end of flash
  addFlashArea(jsFreeFlash, (FLASH_SAVED_CODE_START+FLASH_SAVED_CODE_LENGTH), (SPIFLASH_BASE+SPIFLASH_LENGTH)-(FLASH_SAVED_CODE_START+FLASH_SAVED_CODE_LENGTH));
#endif
#else
  // we have storage in internal flash
  if (firmwareEnd < FLASH_SAVED_CODE_START)
    addFlashArea(jsFreeFlash, firmwareEnd, FLASH_SAVED_CODE_START-firmwareEnd);
  // add whole SPI flash as free
  addFlashArea(jsFreeFlash, SPIFLASH_BASE, SPIFLASH_LENGTH);
#endif
#else
  if (firmwareEnd < FLASH_SAVED_CODE_START)
    addFlashArea(jsFreeFlash, firmwareEnd, FLASH_SAVED_CODE_START-firmwareEnd);
#endif
  return jsFreeFlash;
}

/// Erase the flash page containing the address.
void jshFlashErasePage(uint32_t addr) {
  jshFlashErasePages(addr, 4096);
}

/// Erase the flash pages containing the address - return true on success
bool jshFlashErasePages(uint32_t addr, uint32_t byteLength) {
#ifdef SPIFLASH_BASE
  if ((addr >= SPIFLASH_BASE) && (addr < (SPIFLASH_BASE+SPIFLASH_LENGTH))) {
    addr &= 0xFFFFFF;
#ifdef SPIFLASH_SLEEP_CMD
    if (!spiFlashAwake) spiFlashWakeUp();
#endif
    // disable CS if jshFlashRead had left it set
    if (spiFlashLastAddress) {
      nrf_gpio_pin_set((uint32_t)pinInfo[SPIFLASH_PIN_CS].pin);
      spiFlashLastAddress = 0;
    }
    //jsiConsolePrintf("SPI Erase %d\n",addr);
    unsigned char b[4];
    while (byteLength>=4096 && !jspIsInterrupted()) {
      int erasedBytes = 4096;
      unsigned char eraseCmd = QSPI_STD_CMD_ERASE_4K;
      if (byteLength>=65536 && !(addr&0xFFFF)) { // if 64k aligned and >64k pages left
        eraseCmd = QSPI_STD_CMD_ERASE_64K;
        erasedBytes = 65536;
      }
      if (addr==0 && byteLength>=SPIFLASH_LENGTH) { // if starts at 0 and all flash - erase EVERYTHING
        eraseCmd = QSPI_STD_CMD_ERASE_ALL;
        erasedBytes = SPIFLASH_LENGTH;
      }
      // WREN
      b[0] = QSPI_STD_CMD_WREN;
      spiFlashWriteCS(b,1);
      // Erase
      b[0] = eraseCmd;
      b[1] = addr>>16;
      b[2] = addr>>8;
      b[3] = addr;
      if (eraseCmd == QSPI_STD_CMD_ERASE_ALL) {
        // erase all needs just one arg, but it can also take a while! handle separately
        spiFlashWriteCS(b,1);
        int timeout = WAIT_UNTIL_N_CYCLES*5;
        while ((spiFlashStatus()&1) && !jspIsInterrupted() && (timeout--)>0) {
          jshKickWatchDog();
          jshKickSoftWatchDog();
        }
        if (timeout<=0 || jspIsInterrupted())
          jsExceptionHere(JSET_INTERNALERROR, "Timeout on jshFlashErasePage (all)");
      } else {
        spiFlashWriteCS(b,4);
        WAIT_UNTIL(!(spiFlashStatus()&1), "jshFlashErasePage"); // Check busy
      }
      byteLength -= erasedBytes;
      addr += erasedBytes;
      // Erasing can take a while, so kick the watchdog throughout
      jshKickWatchDog();
      jshKickSoftWatchDog();
    }
    return !jspIsInterrupted();
  }
#endif
  uint32_t startAddr;
  uint32_t pageSize;
  if (!jshFlashGetPage(addr, &startAddr, &pageSize))
    return false;
  if (jshFlashWriteProtect(startAddr) ||
      jshFlashWriteProtect(startAddr + byteLength - 1))
    return false;
  uint32_t err;
  while (byteLength>=4096 && !jspIsInterrupted()) {
    flashIsBusy = true;
    while ((err = sd_flash_page_erase(startAddr / NRF_FICR->CODEPAGESIZE)) == NRF_ERROR_BUSY);
    if (err!=NRF_SUCCESS) flashIsBusy = false;
    WAIT_UNTIL(!flashIsBusy, "jshFlashErasePage");
    /*if (err!=NRF_SUCCESS)
      jsiConsolePrintf("jshFlashErasePage got err %d at 0x%x\n", err, addr);*/
    //nrf_nvmc_page_erase(addr);
    byteLength -= 4096;
    startAddr += 4096;
    // Erasing can take a while, so kick the watchdog throughout
    jshKickWatchDog();
    jshKickSoftWatchDog();
  }
  return !jspIsInterrupted();
}

/**
 * Reads a byte from memory. Addr doesn't need to be word aligned and len doesn't need to be a multiple of 4.
 */
void jshFlashRead(void * buf, uint32_t addr, uint32_t len) {
#ifdef SPIFLASH_BASE
  if ((addr >= SPIFLASH_BASE) && (addr < (SPIFLASH_BASE+SPIFLASH_LENGTH))) {
    addr &= 0xFFFFFF;
    //jsiConsolePrintf("SPI Read %d %d\n",addr,len);
#ifdef SPIFLASH_SLEEP_CMD
    if (!spiFlashAwake) spiFlashWakeUp();
#endif
    if (
        spiFlashLastAddress!=addr
#ifdef SPIFLASH_SHARED_SPI
        /* with shared SPI someone might interrupt us and pull our CS pin high (also jshFlashWrite/Erase does this too) */
        || (nrf_gpio_pin_out_read((uint32_t)pinInfo[SPIFLASH_PIN_CS].pin))
#else
        /* our internal state that no read is pending = CS is high */
        || spiFlashLastAddress==0
#endif
       ) {
      NRF_GPIO_PIN_SET_FAST((uint32_t)pinInfo[SPIFLASH_PIN_CS].pin);
      uint32_t b;
      // Read
#ifdef SPIFLASH_READ2X
      b = 0x3B000000; // uses MOSI to double-up data transfer
#else
      b = 0x03000000;
#endif
      b |= addr;
      NRF_GPIO_PIN_CLEAR_FAST((uint32_t)pinInfo[SPIFLASH_PIN_CS].pin);
      spiFlashWrite32(b);
#ifdef SPIFLASH_READ2X
      // Shift out dummy byte as fast as we can
      for (int bit=0;bit<8;bit++) {
        NRF_GPIO_PIN_SET_FAST((uint32_t)pinInfo[SPIFLASH_PIN_SCK].pin);
        NRF_GPIO_PIN_CLEAR_FAST((uint32_t)pinInfo[SPIFLASH_PIN_SCK].pin);
      }
#endif
    }
#ifdef SPIFLASH_READ2X
    spiFlashRead2x((unsigned char*)buf,len);
#else
    spiFlashRead((unsigned char*)buf,len);
#endif
    spiFlashLastAddress = addr + len;
    return;
  }
#endif
  memcpy(buf, (void*)addr, len);
}

/**
 * Writes an array of bytes to memory. Addr must be word aligned and len must be a multiple of 4.
 */
void jshFlashWrite(void * buf, uint32_t addr, uint32_t len) {
  //jsiConsolePrintf("\njshFlashWrite 0x%x addr 0x%x -> 0x%x, len %d\n", *(uint32_t*)buf, (uint32_t)buf, addr, len);
#ifdef SPIFLASH_BASE
  if ((addr >= SPIFLASH_BASE) && (addr < (SPIFLASH_BASE+SPIFLASH_LENGTH))) {
    addr &= 0xFFFFFF;
#ifdef SPIFLASH_SLEEP_CMD
    if (!spiFlashAwake) spiFlashWakeUp();
#endif
    // disable CS if jshFlashRead had left it set
    if (spiFlashLastAddress) {
      nrf_gpio_pin_set((uint32_t)pinInfo[SPIFLASH_PIN_CS].pin);
      spiFlashLastAddress = 0;
    }
    //jsiConsolePrintf("SPI Write %d %d\n",addr, len);
    unsigned char b[5];
#if defined(DTNO1_F5)
    /* Hack - for some reason the F5 doesn't seem to like writing >1 byte
     * quickly. Also this way works around paging issues. */
    for (unsigned int i=0;i<len;i++) {
      // WREN
      b[0] = QSPI_STD_CMD_WREN;
      spiFlashWriteCS(b,1);
      // Write
      b[0] = QSPI_STD_CMD_WRITE;
      b[1] = addr>>16;
      b[2] = addr>>8;
      b[3] = addr;
      b[4] = ((unsigned char*)buf)[i];
      spiFlashWriteCS(b,5);
      // Check busy
      WAIT_UNTIL(!(spiFlashStatus()&1), "jshFlashWrite");
      addr++;
    }
#else // Bangle.js is fine though - write quickly
    /* we need to split on 256 byte boundaries. We can
     * start halfway but don't want to write past the end
     * of the page */
    unsigned char *bufPtr = (unsigned char *)buf;
    while (len) {
      uint32_t l = len;
      uint32_t pageOffset = addr & 255;
      uint32_t bytesLeftInPage = 256-pageOffset;
      if (l>bytesLeftInPage) l=bytesLeftInPage;

